// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------
// +----------------------------------------------------------------------

// 请求接口地址 如果有配置则使用配置，否则空字符串表示相对路径
const VUE_APP_API_URL = process.env.VUE_APP_BASE_API || '';
const VUE_APP_WS_URL = process.env.VUE_APP_WS_URL || '';
const SettingMer = {
  // 服务器地址
  httpUrl: VUE_APP_API_URL,
  // 接口请求地址
  apiBaseURL: VUE_APP_API_URL + '/api/',
  // socket连接
  wsSocketUrl: VUE_APP_WS_URL,
};

export default SettingMer;
